// Привет, это записи и алгоритмы со второго семинара (изучаем C#)
// Пример считывания текста с консоли и её преобразование в var(числовой тип данных)
// double varA; // можем также использовать int, да вообще любое
// while(true)
// {
//     if(double.TryParse(Console.ReadLine(), out varA))
//     {
//         break; //прерываем цикл если ввод корректный
//     }
//     else if(varA = "q")
//     {
//         break;
//     }
//     else
//     {
//         Console.WriteLine("Ошибка ввода!"); // продолжаем запрашивать число, если ввод некорректный
//     }
//     Console.WriteLine($"A={varA}");
// }


